In [1]:
import numpy as np
import pandas as pd

In [2]:
train = pd.read_csv("train.csv")
tra_val = pd.read_csv('train_matching.csv')

In [8]:
train.shape

(8509, 2)

In [9]:
train.head()

                               bank  higher_education
0  3755b59782464456bac1aec1a44e0db3               0.0
1  604a550439d644718ea6e1693fbf03dc               0.0
2  542d4776ebe5454fb8ab36f1c276fe0e               1.0
3  ee37fecea44d475ca030cde7ff7d545d               0.0
4  18617a1100f44a99b3a0772341fec3db               0.0

In [10]:
tra_val.shape

(17581, 2)

In [11]:
tra_val.head()

                               bank                               rtk
0  178b387813ac4a63a2200274a9e3876e  e19c0f141e9442c5bdb0d5751f6fba1c
1  47cffa46e6b04389ba91a70735d2c3ff  7df3371aabd349e4ac2de8299238627d
2  f73b767cfd72472aa06df9a69e746aaf  b23d62c7e41145a7ad140a4fcfaafefa
3  48da649603734185b98dcea93484dbc7  63ad789541c54463ad54d0a707b3ab8b
4  37304ef19de542ee8fe8a6f050236525  c0e96de5dd594d948a8b9fde9e6980cb

In [18]:
new_df = train.merge(tra_val) # а так тоже получилось 6354
#  pd.merge(train.bank, tra_val.bank) #так получилось 6354

In [19]:
new_df
#таким образом мы делаем вывод что людей у которых мы знаем сразу несколько параметров = 6354

,bank,higher_education,rtk
0,604a550439d644718ea6e1693fbf03dc,0.0,fece9b32c7d84acb836c3b1271cfdcc9
1,542d4776ebe5454fb8ab36f1c276fe0e,1.0,38ac442698524d178f6ca361e0c603bb
2,ee37fecea44d475ca030cde7ff7d545d,0.0,839669a7588b42ee9e01a9f200e5f638
3,079f07153c0149d19f54646618452929,0.0,f9d8f9f57453493186964049c43da914
4,6dee55b3d7284d18bed3094ee3103812,1.0,6d6b702132d94a8692cba48f4e28e7b2
...,...,...,...
6349,8564a4f0b06d44db882a8b0c2e956344,1.0,0b76cdb34090489282c7d53489c17b98
6350,9ff4ccff76464408822d7dfc6bdef07c,1.0,a595c7d182a94b57a12e4e65a9a6f5f7
6351,352334d727214979b33ab6bd108fd8cc,1.0,541f2b8bc392429f924fdd6259875b78
6352,a00707e26c6447d689d1a85e9cb26121,1.0,81d7af0f94ab452abc6efc38aa20d994
6353,67d608d085d6489197cfc4b6e61a7842,1.0,a6a74071c02d49719a7411c3dd5ccc13

In [20]:
trans = pd.read_csv('transactions.csv')

In [49]:
trans.head()

,user_id,mcc_code,currency_rk,transaction_amt,transaction_dttm
0,000932580e404dafbecd5916d4640938,5411,48,-361.07230,2020-08-03 08:05:23
1,000932580e404dafbecd5916d4640938,5499,48,-137.31398,2020-08-05 01:27:40
2,000932580e404dafbecd5916d4640938,5499,48,-138.84981,2020-08-05 03:28:11
3,000932580e404dafbecd5916d4640938,4829,48,-309.47653,2020-08-06 00:36:29
4,000932580e404dafbecd5916d4640938,5411,48,-133.47370,2020-08-09 00:30:13

In [21]:
trans.shape

(19821910, 5)

In [ ]:
trans = trans.rename(columns={''})